#### LoadedFamilyIntegrityCheck Members

---

|  |
| --- |
| LoadedFamilyIntegrityCheck Class   Methods   See Also |

The  LoadedFamilyIntegrityCheck  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CheckAllFamilies | Check that all families loaded in the host document have their content documents. |
| Public method Static member | CheckAllFamiliesSlow | Check integrity of content documents of all families loaded in the host document. |
| Public method Static member | CheckFamily | Check that the loaded family has its content document. |

# See Also

LoadedFamilyIntegrityCheck Class

Autodesk.Revit.DB Namespace